{
  "greetings": {
    "player": [
      "What can I help you with today?",
      "Hey there. What's the problem?",
      "Welcome. What brings you in?",
      "What've you got for me?",
      "Let's see what we're dealing with.",
      "Another one bites the dust, huh? Show me.",
      "Tech troubles? You're in the right place.",
      "Alright, let's take a look.",
      "What's giving you grief today?",
      "Lay it on me. What's broken?"
    ],
    "customer_entering": [
      "The door chimes. A customer walks in.",
      "Someone pushes through the door, device in hand.",
      "A figure enters, looking around nervously.",
      "The entrance sensor beeps. New customer.",
      "Footsteps approach the counter.",
      "Another visitor. They're clutching something electronic.",
      "The door slides open. Customer incoming.",
      "Someone new. They look like they need help."
    ]
  },

  "problems": {
    "virus": {
      "descriptions": [
        "My {device} is acting weird. Pop-ups everywhere, running slow...",
        "I think I downloaded something bad. It's completely infected now.",
        "Something's wrong. Programs opening by themselves, files disappearing...",
        "It started after I clicked that link. Now it's a mess.",
        "Malware. Definitely malware. Can you clean it?",
        "Every time I boot up, weird stuff happens. Pop-ups, redirects...",
        "My kid downloaded something. Now it's full of viruses.",
        "I got hacked, I think. Everything's compromised.",
        "There's this program I can't delete. It keeps coming back.",
        "Something's mining crypto on my {device}. It's burning hot.",
        "Ransomware. They want money. I'm not paying.",
        "It's infected bad. Won't even let me open settings.",
        "Clicked a bad email attachment. Rookie mistake.",
        "The antivirus isn't catching it. Something's hiding in there.",
        "Pop-ups about 'cleaning my system' - but they ARE the virus.",
        "Someone remote accessed my {device}. I watched it happen.",
        "It's spreading to other devices on my network now.",
        "Fake antivirus installed itself. Now it's blocking everything.",
        "Browser hijacked. Every search goes somewhere sketchy.",
        "My files are all encrypted. This is bad.",
        "Keylogger, maybe? My accounts keep getting compromised.",
        "Something's using all my bandwidth. Probably a botnet.",
        "Got a trojan from a cracked game. Worth it? No.",
        "The whole system is unstable now. Crashes, freezes, the works.",
        "I can see processes I didn't start. Something's in there.",
        "My webcam light keeps turning on by itself. Creepy.",
        "Adware. Thousands of ads. Everywhere. Make it stop.",
        "It's pretending to be a system update. But it's not.",
        "Something's sending emails from my account. I didn't write those.",
        "The virus disabled my firewall. Now what?",
        "I ran a scan but it found nothing. It's still there though.",
        "My homepage changed and I can't change it back.",
        "Fake tech support called me. I let them in. I know, I know...",
        "There's a countdown on my screen. Says I have 24 hours.",
        "It infected my backup drive too. Everything's compromised.",
        "Some worm spread through my whole setup.",
        "The malware's in the firmware, I think. Deep infection.",
        "Spyware. Someone's watching everything I do.",
        "It's cryptolocked. All my photos, documents... gone?",
        "My {device} is part of a botnet now. Help.",
        "Zero-day exploit got me. Didn't even do anything wrong.",
        "The infection survived a factory reset. How?!",
        "Something's intercepting my network traffic.",
        "Fake login pages keep appearing. Phishing from inside.",
        "My passwords are being changed. Someone's in my accounts.",
        "The virus is fighting back when I try to remove it.",
        "Multiple infections. It's like a zoo in there.",
        "Something's corrupting files slowly. Death by a thousand cuts.",
        "I can hear my hard drive working constantly. Mining, probably.",
        "It started as one pop-up. Now it's an infestation."
      ]
    },
    "corruption": {
      "descriptions": [
        "I can't open any of my files anymore. They're all corrupted.",
        "My work files are gone. The system says they're corrupted.",
        "Everything was fine yesterday, now nothing works right.",
        "File system's trashed. Can't access anything.",
        "Bad sectors everywhere. Data's scrambled.",
        "Power went out during a write. Now half my drive is garbage.",
        "The partition table is corrupted. OS won't even boot.",
        "My database got corrupted. Years of work...",
        "Photos from my trip - all corrupted. Please tell me you can fix this.",
        "System files are damaged. Windows keeps failing to repair.",
        "The registry is a mess. Nothing works properly.",
        "Firmware corruption. It's bricked, basically.",
        "Half my files open as garbage characters now.",
        "Disk check found errors it couldn't fix.",
        "The file headers are all wrong. Software can't read them.",
        "Corruption spread from one file to the whole folder.",
        "My backup is corrupted too. Of course it is.",
        "Video files won't play. Say they're corrupted.",
        "Document got corrupted mid-save. It's my thesis...",
        "Memory corruption causing random crashes and data loss.",
        "The filesystem went read-only. Something's very wrong.",
        "Corruption in the boot sector. Classic.",
        "My email database is corrupted. Thousands of messages.",
        "The index file is broken. Can't search anything.",
        "Partial corruption - some files work, some don't.",
        "Bad RAM corrupted data as it was being written.",
        "The corruption happened during a transfer. Network issue.",
        "Archive file is corrupted. Can't extract anything.",
        "Disk encryption key got corrupted. Locked out of everything.",
        "Firmware update failed. Now there's corruption everywhere.",
        "The log files are corrupted. Can't even diagnose properly.",
        "Silent corruption. Didn't notice until it was too late.",
        "Configuration files corrupted. App won't start.",
        "The corruption is spreading every time I boot up.",
        "Checksum errors everywhere. Data integrity is shot.",
        "My music library - all the metadata is corrupted.",
        "Corruption in the MBR. Won't boot at all.",
        "Project files corrupted. Months of design work.",
        "The cache got corrupted and took other files with it.",
        "Temp files corrupted the originals somehow.",
        "Corruption from a bad cable, I think. Flaky connection.",
        "Disk is clicking. Data corruption is the least of my problems.",
        "Cloud sync corrupted local copies. Brilliant.",
        "The filesystem journal is corrupted. Recovery is messy.",
        "Bit rot got to my old archives. They're unreadable.",
        "Corruption in the allocation table. Files are there but inaccessible.",
        "My VM images got corrupted. There goes my dev environment.",
        "The corruption seems targeted. Almost deliberate.",
        "Symbolic links broken. Everything's pointing nowhere.",
        "Compression corruption. Files extract as garbage."
      ]
    },
    "slowdown": {
      "descriptions": [
        "It's so slow now. Takes forever to do anything.",
        "Used to be fast, now it crawls. Can barely check email.",
        "Performance has tanked. Something's eating all the resources.",
        "Boot time went from seconds to minutes. What happened?",
        "Everything hangs for ages before responding.",
        "Can't even watch videos anymore. Constant buffering.",
        "The {device} thinks for ten seconds before anything happens.",
        "Typing lag. I type and wait for letters to appear.",
        "Multitasking is impossible now. One app at a time, barely.",
        "It wasn't always this slow. Something changed.",
        "Games that used to run fine now stutter constantly.",
        "Even simple tasks take forever. Opening folders, anything.",
        "The CPU is pegged at 100% doing nothing visible.",
        "Memory fills up instantly. Then everything crawls.",
        "Network is fine but downloads are painfully slow.",
        "Scrolling is choppy. Basic scrolling!",
        "Apps take ages to launch. I can make coffee waiting.",
        "It's gotten progressively slower over months.",
        "After the last update, everything went to hell.",
        "Disk usage at 100% constantly. No idea why.",
        "The interface is laggy. Menus take seconds to open.",
        "Saving files takes ten times longer than it should.",
        "Browser tabs crash if I open more than three.",
        "Search takes forever. Indexing something constantly?",
        "Startup programs are killing my boot time.",
        "The slowdown gets worse the longer it's on.",
        "Antivirus scans bring everything to a halt.",
        "Copy operations are painfully slow.",
        "Even sleep/wake is slow now. Minutes to resume.",
        "Graphics are choppy. Even the desktop animations.",
        "File explorer hangs whenever I open it.",
        "It's fast for five minutes, then grinds to a halt.",
        "Updates are set to download and it's tanking everything.",
        "Switching apps takes forever. Alt-tab is a joke.",
        "The slowdown only happens when connected to internet.",
        "Defragging didn't help. Neither did cleanup.",
        "Thermal throttling maybe? It's running hot.",
        "Virtual memory is thrashing constantly.",
        "Simple operations max out the disk. Shouldn't happen.",
        "Browser is slow. Maybe too many extensions.",
        "The {device} needs a minute to wake from screensaver.",
        "Productivity apps are unusable. Constant spinning wheel.",
        "Sync services are crushing performance.",
        "It's slow and the fan runs like a jet engine.",
        "Login takes several minutes now. Just to see desktop.",
        "Preview panes freeze everything. Had to disable them.",
        "Right-click context menu takes ages to appear.",
        "Shutdown takes forever. Something won't close.",
        "Print spooler issues making everything crawl.",
        "The slowdown coincides with when I installed... something."
      ]
    },
    "crash": {
      "descriptions": [
        "It keeps crashing randomly. Lost work three times today.",
        "Blue screens all the time now. Can't trust it anymore.",
        "Freezes up, then crashes. Over and over.",
        "Kernel panic every few hours. Like clockwork.",
        "Apps crash constantly. Nothing stays open.",
        "System hard locks. Have to hold power button.",
        "Crashes during specific tasks. Reproducible but unfixable.",
        "Random reboots with no warning.",
        "Crashes more when it gets hot. Thermal issue?",
        "Black screen crashes. Screen goes dark, system dead.",
        "It crashes when I plug in USB devices.",
        "Graphics driver crashes and recovers, over and over.",
        "Crashes on startup before I can do anything.",
        "Memory-related crashes. Bad RAM?",
        "Crashes only when gaming or under load.",
        "Browser crashes take down the whole system.",
        "Sleep mode crashes. Won't wake up properly.",
        "Crashes during file operations. Corrupting my data.",
        "Update process crashes. Stuck in a loop.",
        "Audio glitches before every crash. Then freeze.",
        "Crashes leave error logs I can't understand.",
        "Network activity seems to trigger crashes.",
        "Crashes when I run multiple monitors.",
        "The crash dumps are enormous. Gigabytes.",
        "Specific software always crashes. Worked before.",
        "Hardware acceleration causes instant crash.",
        "Crashes with a specific error code. Looked it up, no help.",
        "The {device} crashes when I move it. Loose connection?",
        "Crashes more frequently as the day goes on.",
        "Secure boot crashes. Have to disable it.",
        "VPN connection triggers crashes every time.",
        "Crashes during video calls. Very professional.",
        "The crash pattern is totally random. No consistency.",
        "Overclocking is off but it crashes like it's on.",
        "Driver updates made the crashes worse.",
        "Rolling back drivers didn't fix the crashes.",
        "Fresh install. Still crashes. Hardware?",
        "Crashes leave the screen frozen on last frame.",
        "System recovers from crash but apps lose data.",
        "Crash, auto-restart, crash again. Loop.",
        "Crashes only in the evening. Temperature related?",
        "Plugging in charger causes crash. Every time.",
        "Crashes with loud buzzing from speakers.",
        "The crashes started after a Windows update.",
        "Opening specific file types causes crash.",
        "Crashes more on battery than plugged in.",
        "System monitor shows nothing wrong before crash.",
        "Crashes when printing. Something's conflicting.",
        "Hibernate crashes. Can't use it anymore.",
        "Crashes have corrupted my recovery partition."
      ]
    },
    "recovery": {
      "descriptions": [
        "I need my files back. Photos, documents - everything important.",
        "It won't boot anymore. I need the data recovered.",
        "My backup failed and now this happened. Please tell me you can get my files.",
        "Accidentally deleted everything. Is it recoverable?",
        "Formatted the wrong drive. Years of data.",
        "Dropped it. Drive's clicking. But I need those files.",
        "Lost partition. It's there, I just can't see it.",
        "Deleted my project folder. Emptied recycle bin. Then panicked.",
        "Drive failure. No recent backup. I know, I know...",
        "Need to recover data from a dead SSD. Possible?",
        "Water damage. Drive might still be okay?",
        "The encryption key is lost. Need the files anyway.",
        "Overwrote important files. Any chance?",
        "Drive won't mount. Data should still be there.",
        "NAS failed. Multiple drives. RAID didn't save me.",
        "Recover from a formatted and partially overwritten drive.",
        "Memory card corrupted. Photos from the wedding.",
        "Fire damage. Some devices might be recoverable.",
        "Inherited this from someone who passed. Need their files.",
        "Old drive from years ago. Can you read it?",
        "USB drive stopped working. Important documents.",
        "Phone screen is shattered. Need to extract data.",
        "Laptop won't turn on. Data recovery only.",
        "Deleted VM with all my work inside.",
        "Time Machine backup is corrupted. Need old files.",
        "External drive dropped. Now clicking.",
        "Recovery partition is gone. Original files needed.",
        "SSD wear leveling hid my deleted files. Can you find them?",
        "Accidentally merged/overwrote the wrong branch. Git disaster.",
        "Cloud account hacked, files deleted, need local recovery.",
        "Recover texts and photos from broken phone.",
        "Old media format. No one can read it anymore.",
        "BitLocker locked me out. Data still accessible?",
        "Recover deleted emails from local client.",
        "Drive from a crashed drone. Flight footage needed.",
        "Security cam footage deleted. Need it for evidence.",
        "Restore point is corrupted. Previous versions gone.",
        "Temp files had important unsaved work.",
        "Recover data from a failing SSD before it dies completely.",
        "Previous owner 'wiped' the drive. Thoroughly?",
        "Dead phone. No cloud backup. Photos of my kids.",
        "BIOS update bricked it. Data should be fine though?",
        "Thunderbolt drive stopped being recognized.",
        "Recover files from encrypted drive, have the password.",
        "Extract data from old tape backup.",
        "Mac Fusion drive failed. It's complicated.",
        "Surveillance DVR died. Footage critical.",
        "Recover specific file versions from before corruption.",
        "Clone dying drive before it completely fails.",
        "Recover data written to wrong disk that was then formatted."
      ]
    },
    "cleanup": {
      "descriptions": [
        "It's full of junk. Bloatware, old programs, who knows what.",
        "Just needs a good cleaning. Running out of space.",
        "Can you just... make it feel new again?",
        "Accumulated years of garbage. Needs a fresh start.",
        "Too many programs installed. Don't need most of them.",
        "Temp files everywhere. Eating all my space.",
        "Browser has hundreds of extensions I didn't install.",
        "Startup takes forever. Too much loading at once.",
        "Old software I can't uninstall properly.",
        "Need to clean before selling. Securely.",
        "Duplicate files everywhere. Wasting space.",
        "Program remnants left after uninstalls.",
        "Cache is gigabytes. Never been cleared.",
        "Old user profiles taking up space.",
        "Downloads folder is a nightmare. Years of stuff.",
        "System restore points eating the drive.",
        "Need bloatware removed. Fresh from manufacturer.",
        "Clean install would be nice. Keep my data though.",
        "Browser profiles corrupted. Need a clean slate.",
        "Toolbars. So many toolbars. Make them go away.",
        "Optimize for performance. Don't care about features.",
        "Registry is bloated. Thousands of orphan entries.",
        "Uninstaller left files everywhere.",
        "Scheduled tasks I didn't create. Clean them up.",
        "Services running that shouldn't be.",
        "Context menu has fifty entries. Needs trimming.",
        "Notification center is chaos. Clean it up.",
        "Multiple antiviruses installed. Fighting each other.",
        "Old drivers lingering. Conflicts possible.",
        "Fonts. Thousands of fonts. Why do I have these?",
        "Login items multiplied somehow.",
        "System preferences are a mess. Reset to defaults?",
        "App data folders from apps I deleted years ago.",
        "Gaming platform caches filling the SSD.",
        "Development environments leaving garbage everywhere.",
        "Virtual machine files taking huge space.",
        "Old iOS backups eating hundreds of gigs.",
        "Clean up and document what's actually installed.",
        "Remove pre-installed games and apps.",
        "Old kernels filling boot partition.",
        "Package manager cache never cleaned.",
        "Snap/flatpak duplicates wasting space.",
        "Container images accumulated. Prune them.",
        "Log files grown to gigabytes.",
        "Crash dumps eating space.",
        "Old project files from years ago. Archive and clean.",
        "Media library disorganized. Duplicates everywhere.",
        "Email client storing everything locally. Huge.",
        "Browser profiles. Like 12 of them. Need one.",
        "Just make it run like when I first got it."
      ]
    }
  },

  "urgency": {
    "desperate": {
      "initial": [
        "I really need this fixed fast. It's urgent.",
        "Please, I'm desperate. Work deadline tomorrow.",
        "This is an emergency. How soon can you fix it?",
        "I'll pay extra. Just make it fast.",
        "My boss is going to kill me if this isn't fixed today.",
        "Critical data on there. Time sensitive.",
        "Event tomorrow. Need this working.",
        "Client presentation in hours. Please help.",
        "Already missed one deadline because of this.",
        "Every hour this is down costs me money."
      ],
      "accept_counter": [
        "...Fine. But please, as fast as you can.",
        "Okay, okay. I'll figure something out. Just fix it.",
        "That's rough but I have no choice.",
        "Alright. Just... don't forget about me.",
        "I'll make it work. Please prioritize this."
      ],
      "reject_counter": [
        "That's too long. I'll try somewhere else.",
        "I can't wait that long. Thanks anyway.",
        "No, I need it sooner. Sorry.",
        "That won't work for me. I'll find another shop.",
        "Time I don't have. Thanks though."
      ],
      "accept_rush": [
        "Done. Whatever it takes.",
        "Yes. Money's not the issue, time is.",
        "Thank god. Yes, rush it.",
        "Take my money. Just fix it fast.",
        "Absolutely. Rush it please."
      ],
      "job_confirmed": [
        "Thank you so much! You're a lifesaver.",
        "I owe you one. Seriously.",
        "You're saving my life here.",
        "I'll be counting the minutes. Thank you.",
        "Finally some good news today. Thanks."
      ]
    },
    "normal": {
      "initial": [
        "When can you have it done?",
        "What's your turnaround time?",
        "How long do you think this will take?",
        "Is there a wait or can you start now?",
        "What's a realistic timeline?",
        "I'm flexible on timing. Within reason.",
        "Sooner is better but no crazy rush.",
        "Whenever you can get to it.",
        "Standard timing is fine.",
        "What do you usually quote for this?"
      ],
      "accept_counter": [
        "Alright, I can wait. See you then.",
        "That works. I'll be back.",
        "Okay, no problem.",
        "Fine by me. Just let me know when it's ready.",
        "Sure thing. See you then."
      ],
      "reject_counter": [
        "Hmm, that's later than I hoped. Let me think about it.",
        "That's a bit long. I might shop around.",
        "I'll consider it. Thanks.",
        "Maybe I'll try somewhere else first.",
        "Let me see what other options I have."
      ],
      "accept_rush": [
        "...Okay, fine. I really need it fixed.",
        "That's steep but alright.",
        "Guess I'll pay for rush then.",
        "Fine, let's do rush.",
        "Worth it to have it done. Okay."
      ],
      "reject_rush": [
        "That's steep. What about regular timing?",
        "Too rich for my blood. Normal pace is fine.",
        "Nah, I can wait. Regular price please.",
        "I'll just wait for standard timing.",
        "Not that urgent. Regular is fine."
      ],
      "job_confirmed": [
        "Sounds good. I'll be back then.",
        "Thanks. See you soon.",
        "Alright, looking forward to it.",
        "Great. I'll come pick it up then.",
        "Perfect. Thanks for the help."
      ]
    },
    "flexible": {
      "initial": [
        "No huge rush. Take your time.",
        "Whenever you can get to it is fine.",
        "I'm in no hurry. Do it right.",
        "Flexible on timing. Quality over speed.",
        "It's not urgent. Whenever works.",
        "Low priority honestly. Fit me in when you can.",
        "I've got a backup. No rush on this one.",
        "Take what time you need.",
        "It's been broken for a while already. Few more days won't hurt.",
        "Whenever is convenient for you."
      ],
      "accept_counter": [
        "No problem, take your time. Any discount for the wait?",
        "Sure, no rush. Appreciate the honesty.",
        "That's fine. Quality takes time.",
        "Works for me. I'll check back then.",
        "No worries. I'll be patient."
      ],
      "reject_rush": [
        "That's way more than I wanted to spend. I'll just wait.",
        "No rush is worth that much. Regular pace please.",
        "I said no rush, remember? Regular is fine.",
        "Save your rush slot for someone who needs it.",
        "Nope. Standard timing. I can wait."
      ],
      "job_confirmed": [
        "Perfect. No rush. See you whenever.",
        "Thanks. Take your time with it.",
        "Great. I'm patient. Do good work.",
        "Sounds good. I'll check in later.",
        "Thanks. No need to stress on my account."
      ]
    }
  },

  "decline_reaction": [
    "Oh. Okay then.",
    "Alright. Thanks anyway.",
    "I understand. I'll try somewhere else.",
    "No worries. Have a good one.",
    "That's unfortunate. Okay.",
    "Fair enough. Thanks for your time.",
    "I get it. You're busy.",
    "Okay. Know anyone else who might help?",
    "Shame. This looked like a good shop.",
    "Alright. Worth a shot."
  ],

  "decline_reaction_desperate": [
    "What? But I really need help! ...Fine.",
    "Seriously? I'm desperate here. ...Whatever.",
    "You're killing me. Fine, I'll find someone else.",
    "This is a disaster. Okay, okay, I'm going.",
    "Please reconsider? No? ...Alright.",
    "You're my third shop today. Great.",
    "I don't have time for this. Fine.",
    "My deadline... okay, I'll figure something out.",
    "Wow. Okay. Good luck with your business.",
    "Unbelievable. Fine, I'm leaving."
  ]
}
