{
  "greetings": {
    "player": [
      "What can I help you with today?",
      "Hey there. What's the problem?",
      "Welcome. What brings you in?",
      "What've you got for me?",
      "Let's see what we're dealing with.",
      "Another one bites the dust, huh? Show me.",
      "Tech troubles? You're in the right place.",
      "Alright, let's take a look.",
      "What's giving you grief today?",
      "Lay it on me. What's broken?"
    ],
    "customer_entering": [
      "The door chimes. A customer walks in.",
      "Someone pushes through the door, device in hand.",
      "A figure enters, looking around nervously.",
      "The entrance sensor beeps. New customer.",
      "Footsteps approach the counter.",
      "Another visitor. They're clutching something electronic.",
      "The door slides open. Customer incoming.",
      "Someone new. They look like they need help.",
      "A customer stumbles in, looking like they haven't slept in days.",
      "Someone rushes in, wild-eyed and clutching a smoking device.",
      "The door bangs open. An elderly person peers around suspiciously.",
      "A figure in a tinfoil hat enters, scanning the room for hidden cameras.",
      "Someone enters dramatically, clutching their device like it's a dying loved one.",
      "A student bursts in, papers flying everywhere, looking completely panicked.",
      "The door opens slowly. An old lady shuffles in, holding her device at arm's length.",
      "Someone wearing multiple layers of tinfoil enters backwards. Just in case.",
      "A customer enters weeping openly, cradling their broken device like an injured pet.",
      "Someone rushes in wearing a bathrobe over their clothes. Time-sensitive emergency!",
      "An old timer enters, squinting at everything. The light hurts their eyes.",
      "A person enters wearing sunglasses indoors. They're definitely being watched."
    ]
  },

  "problems": {
    "virus": {
      "descriptions": [
        "My {device} is acting weird. Pop-ups everywhere, running slow...",
        "I think I downloaded something bad. It's completely infected now.",
        "Something's wrong. Programs opening by themselves, files disappearing...",
        "It started after I clicked that link. Now it's a mess.",
        "Malware. Definitely malware. Can you clean it?",
        "Every time I boot up, weird stuff happens. Pop-ups, redirects...",
        "My kid downloaded something. Now it's full of viruses.",
        "I got hacked, I think. Everything's compromised.",
        "There's this program I can't delete. It keeps coming back.",
        "Something's mining crypto on my {device}. It's burning hot.",
        "Ransomware. They want money. I'm not paying.",
        "It's infected bad. Won't even let me open settings.",
        "Clicked a bad email attachment. Rookie mistake.",
        "The antivirus isn't catching it. Something's hiding in there.",
        "Pop-ups about 'cleaning my system' - but they ARE the virus.",
        "Someone remote accessed my {device}. I watched it happen.",
        "It's spreading to other devices on my network now.",
        "Fake antivirus installed itself. Now it's blocking everything.",
        "Browser hijacked. Every search goes somewhere sketchy.",
        "My files are all encrypted. This is bad.",
        "Keylogger, maybe? My accounts keep getting compromised.",
        "Something's using all my bandwidth. Probably a botnet.",
        "Got a trojan from a cracked game. Worth it? No.",
        "The whole system is unstable now. Crashes, freezes, the works.",
        "I can see processes I didn't start. Something's in there.",
        "My webcam light keeps turning on by itself. Creepy.",
        "Adware. Thousands of ads. Everywhere. Make it stop.",
        "It's pretending to be a system update. But it's not.",
        "Something's sending emails from my account. I didn't write those.",
        "The virus disabled my firewall. Now what?",
        "I ran a scan but it found nothing. It's still there though.",
        "My homepage changed and I can't change it back.",
        "Fake tech support called me. I let them in. I know, I know...",
        "There's a countdown on my screen. Says I have 24 hours.",
        "It infected my backup drive too. Everything's compromised.",
        "Some worm spread through my whole setup.",
        "The malware's in the firmware, I think. Deep infection.",
        "Spyware. Someone's watching everything I do.",
        "It's cryptolocked. All my photos, documents... gone?",
        "My {device} is part of a botnet now. Help.",
        "Zero-day exploit got me. Didn't even do anything wrong.",
        "The infection survived a factory reset. How?!",
        "Something's intercepting my network traffic.",
        "Fake login pages keep appearing. Phishing from inside.",
        "My passwords are being changed. Someone's in my accounts.",
        "The virus is fighting back when I try to remove it.",
        "Multiple infections. It's like a zoo in there.",
        "Something's corrupting files slowly. Death by a thousand cuts.",
        "I can hear my hard drive working constantly. Mining, probably.",
        "It started as one pop-up. Now it's an infestation."
      ]
    },
    "corruption": {
      "descriptions": [
        "I can't open any of my files anymore. They're all corrupted.",
        "My work files are gone. The system says they're corrupted.",
        "Everything was fine yesterday, now nothing works right.",
        "File system's trashed. Can't access anything.",
        "Bad sectors everywhere. Data's scrambled.",
        "Power went out during a write. Now half my drive is garbage.",
        "The partition table is corrupted. OS won't even boot.",
        "My database got corrupted. Years of work...",
        "Photos from my trip - all corrupted. Please tell me you can fix this.",
        "System files are damaged. Windows keeps failing to repair.",
        "The registry is a mess. Nothing works properly.",
        "Firmware corruption. It's bricked, basically.",
        "Half my files open as garbage characters now.",
        "Disk check found errors it couldn't fix.",
        "The file headers are all wrong. Software can't read them.",
        "Corruption spread from one file to the whole folder.",
        "My backup is corrupted too. Of course it is.",
        "Video files won't play. Say they're corrupted.",
        "Document got corrupted mid-save. It's my thesis...",
        "Memory corruption causing random crashes and data loss.",
        "The filesystem went read-only. Something's very wrong.",
        "Corruption in the boot sector. Classic.",
        "My email database is corrupted. Thousands of messages.",
        "The index file is broken. Can't search anything.",
        "Partial corruption - some files work, some don't.",
        "Bad RAM corrupted data as it was being written.",
        "The corruption happened during a transfer. Network issue.",
        "Archive file is corrupted. Can't extract anything.",
        "Disk encryption key got corrupted. Locked out of everything.",
        "Firmware update failed. Now there's corruption everywhere.",
        "The log files are corrupted. Can't even diagnose properly.",
        "Silent corruption. Didn't notice until it was too late.",
        "Configuration files corrupted. App won't start.",
        "The corruption is spreading every time I boot up.",
        "Checksum errors everywhere. Data integrity is shot.",
        "My music library - all the metadata is corrupted.",
        "Corruption in the MBR. Won't boot at all.",
        "Project files corrupted. Months of design work.",
        "The cache got corrupted and took other files with it.",
        "Temp files corrupted the originals somehow.",
        "Corruption from a bad cable, I think. Flaky connection.",
        "Disk is clicking. Data corruption is the least of my problems.",
        "Cloud sync corrupted local copies. Brilliant.",
        "The filesystem journal is corrupted. Recovery is messy.",
        "Bit rot got to my old archives. They're unreadable.",
        "Corruption in the allocation table. Files are there but inaccessible.",
        "My VM images got corrupted. There goes my dev environment.",
        "The corruption seems targeted. Almost deliberate.",
        "Symbolic links broken. Everything's pointing nowhere.",
        "Compression corruption. Files extract as garbage."
      ]
    },
    "slowdown": {
      "descriptions": [
        "It's so slow now. Takes forever to do anything.",
        "Used to be fast, now it crawls. Can barely check email.",
        "Performance has tanked. Something's eating all the resources.",
        "Boot time went from seconds to minutes. What happened?",
        "Everything hangs for ages before responding.",
        "Can't even watch videos anymore. Constant buffering.",
        "The {device} thinks for ten seconds before anything happens.",
        "Typing lag. I type and wait for letters to appear.",
        "Multitasking is impossible now. One app at a time, barely.",
        "It wasn't always this slow. Something changed.",
        "Games that used to run fine now stutter constantly.",
        "Even simple tasks take forever. Opening folders, anything.",
        "The CPU is pegged at 100% doing nothing visible.",
        "Memory fills up instantly. Then everything crawls.",
        "Network is fine but downloads are painfully slow.",
        "Scrolling is choppy. Basic scrolling!",
        "Apps take ages to launch. I can make coffee waiting.",
        "It's gotten progressively slower over months.",
        "After the last update, everything went to hell.",
        "Disk usage at 100% constantly. No idea why.",
        "The interface is laggy. Menus take seconds to open.",
        "Saving files takes ten times longer than it should.",
        "Browser tabs crash if I open more than three.",
        "Search takes forever. Indexing something constantly?",
        "Startup programs are killing my boot time.",
        "The slowdown gets worse the longer it's on.",
        "Antivirus scans bring everything to a halt.",
        "Copy operations are painfully slow.",
        "Even sleep/wake is slow now. Minutes to resume.",
        "Graphics are choppy. Even the desktop animations.",
        "File explorer hangs whenever I open it.",
        "It's fast for five minutes, then grinds to a halt.",
        "Updates are set to download and it's tanking everything.",
        "Switching apps takes forever. Alt-tab is a joke.",
        "The slowdown only happens when connected to internet.",
        "Defragging didn't help. Neither did cleanup.",
        "Thermal throttling maybe? It's running hot.",
        "Virtual memory is thrashing constantly.",
        "Simple operations max out the disk. Shouldn't happen.",
        "Browser is slow. Maybe too many extensions.",
        "The {device} needs a minute to wake from screensaver.",
        "Productivity apps are unusable. Constant spinning wheel.",
        "Sync services are crushing performance.",
        "It's slow and the fan runs like a jet engine.",
        "Login takes several minutes now. Just to see desktop.",
        "Preview panes freeze everything. Had to disable them.",
        "Right-click context menu takes ages to appear.",
        "Shutdown takes forever. Something won't close.",
        "Print spooler issues making everything crawl.",
        "The slowdown coincides with when I installed... something."
      ]
    },
    "crash": {
      "descriptions": [
        "It keeps crashing randomly. Lost work three times today.",
        "Blue screens all the time now. Can't trust it anymore.",
        "Freezes up, then crashes. Over and over.",
        "Kernel panic every few hours. Like clockwork.",
        "Apps crash constantly. Nothing stays open.",
        "System hard locks. Have to hold power button.",
        "Crashes during specific tasks. Reproducible but unfixable.",
        "Random reboots with no warning.",
        "Crashes more when it gets hot. Thermal issue?",
        "Black screen crashes. Screen goes dark, system dead.",
        "It crashes when I plug in USB devices.",
        "Graphics driver crashes and recovers, over and over.",
        "Crashes on startup before I can do anything.",
        "Memory-related crashes. Bad RAM?",
        "Crashes only when gaming or under load.",
        "Browser crashes take down the whole system.",
        "Sleep mode crashes. Won't wake up properly.",
        "Crashes during file operations. Corrupting my data.",
        "Update process crashes. Stuck in a loop.",
        "Audio glitches before every crash. Then freeze.",
        "Crashes leave error logs I can't understand.",
        "Network activity seems to trigger crashes.",
        "Crashes when I run multiple monitors.",
        "The crash dumps are enormous. Gigabytes.",
        "Specific software always crashes. Worked before.",
        "Hardware acceleration causes instant crash.",
        "Crashes with a specific error code. Looked it up, no help.",
        "The {device} crashes when I move it. Loose connection?",
        "Crashes more frequently as the day goes on.",
        "Secure boot crashes. Have to disable it.",
        "VPN connection triggers crashes every time.",
        "Crashes during video calls. Very professional.",
        "The crash pattern is totally random. No consistency.",
        "Overclocking is off but it crashes like it's on.",
        "Driver updates made the crashes worse.",
        "Rolling back drivers didn't fix the crashes.",
        "Fresh install. Still crashes. Hardware?",
        "Crashes leave the screen frozen on last frame.",
        "System recovers from crash but apps lose data.",
        "Crash, auto-restart, crash again. Loop.",
        "Crashes only in the evening. Temperature related?",
        "Plugging in charger causes crash. Every time.",
        "Crashes with loud buzzing from speakers.",
        "The crashes started after a Windows update.",
        "Opening specific file types causes crash.",
        "Crashes more on battery than plugged in.",
        "System monitor shows nothing wrong before crash.",
        "Crashes when printing. Something's conflicting.",
        "Hibernate crashes. Can't use it anymore.",
        "Crashes have corrupted my recovery partition."
      ]
    },
    "recovery": {
      "descriptions": [
        "I need my files back. Photos, documents - everything important.",
        "It won't boot anymore. I need the data recovered.",
        "My backup failed and now this happened. Please tell me you can get my files.",
        "Accidentally deleted everything. Is it recoverable?",
        "Formatted the wrong drive. Years of data.",
        "Dropped it. Drive's clicking. But I need those files.",
        "Lost partition. It's there, I just can't see it.",
        "Deleted my project folder. Emptied recycle bin. Then panicked.",
        "Drive failure. No recent backup. I know, I know...",
        "Need to recover data from a dead SSD. Possible?",
        "Water damage. Drive might still be okay?",
        "The encryption key is lost. Need the files anyway.",
        "Overwrote important files. Any chance?",
        "Drive won't mount. Data should still be there.",
        "NAS failed. Multiple drives. RAID didn't save me.",
        "Recover from a formatted and partially overwritten drive.",
        "Memory card corrupted. Photos from the wedding.",
        "Fire damage. Some devices might be recoverable.",
        "Inherited this from someone who passed. Need their files.",
        "Old drive from years ago. Can you read it?",
        "USB drive stopped working. Important documents.",
        "Phone screen is shattered. Need to extract data.",
        "Laptop won't turn on. Data recovery only.",
        "Deleted VM with all my work inside.",
        "Time Machine backup is corrupted. Need old files.",
        "External drive dropped. Now clicking.",
        "Recovery partition is gone. Original files needed.",
        "SSD wear leveling hid my deleted files. Can you find them?",
        "Accidentally merged/overwrote the wrong branch. Git disaster.",
        "Cloud account hacked, files deleted, need local recovery.",
        "Recover texts and photos from broken phone.",
        "Old media format. No one can read it anymore.",
        "BitLocker locked me out. Data still accessible?",
        "Recover deleted emails from local client.",
        "Drive from a crashed drone. Flight footage needed.",
        "Security cam footage deleted. Need it for evidence.",
        "Restore point is corrupted. Previous versions gone.",
        "Temp files had important unsaved work.",
        "Recover data from a failing SSD before it dies completely.",
        "Previous owner 'wiped' the drive. Thoroughly?",
        "Dead phone. No cloud backup. Photos of my kids.",
        "BIOS update bricked it. Data should be fine though?",
        "Thunderbolt drive stopped being recognized.",
        "Recover files from encrypted drive, have the password.",
        "Extract data from old tape backup.",
        "Mac Fusion drive failed. It's complicated.",
        "Surveillance DVR died. Footage critical.",
        "Recover specific file versions from before corruption.",
        "Clone dying drive before it completely fails.",
        "Recover data written to wrong disk that was then formatted."
      ]
    },
    "cleanup": {
      "descriptions": [
        "It's full of junk. Bloatware, old programs, who knows what.",
        "Just needs a good cleaning. Running out of space.",
        "Can you just... make it feel new again?",
        "Accumulated years of garbage. Needs a fresh start.",
        "Too many programs installed. Don't need most of them.",
        "Temp files everywhere. Eating all my space.",
        "Browser has hundreds of extensions I didn't install.",
        "Startup takes forever. Too much loading at once.",
        "Old software I can't uninstall properly.",
        "Need to clean before selling. Securely.",
        "Duplicate files everywhere. Wasting space.",
        "Program remnants left after uninstalls.",
        "Cache is gigabytes. Never been cleared.",
        "Old user profiles taking up space.",
        "Downloads folder is a nightmare. Years of stuff.",
        "System restore points eating the drive.",
        "Need bloatware removed. Fresh from manufacturer.",
        "Clean install would be nice. Keep my data though.",
        "Browser profiles corrupted. Need a clean slate.",
        "Toolbars. So many toolbars. Make them go away.",
        "Optimize for performance. Don't care about features.",
        "Registry is bloated. Thousands of orphan entries.",
        "Uninstaller left files everywhere.",
        "Scheduled tasks I didn't create. Clean them up.",
        "Services running that shouldn't be.",
        "Context menu has fifty entries. Needs trimming.",
        "Notification center is chaos. Clean it up.",
        "Multiple antiviruses installed. Fighting each other.",
        "Old drivers lingering. Conflicts possible.",
        "Fonts. Thousands of fonts. Why do I have these?",
        "Login items multiplied somehow.",
        "System preferences are a mess. Reset to defaults?",
        "App data folders from apps I deleted years ago.",
        "Gaming platform caches filling the SSD.",
        "Development environments leaving garbage everywhere.",
        "Virtual machine files taking huge space.",
        "Old iOS backups eating hundreds of gigs.",
        "Clean up and document what's actually installed.",
        "Remove pre-installed games and apps.",
        "Old kernels filling boot partition.",
        "Package manager cache never cleaned.",
        "Snap/flatpak duplicates wasting space.",
        "Container images accumulated. Prune them.",
        "Log files grown to gigabytes.",
        "Crash dumps eating space.",
        "Old project files from years ago. Archive and clean.",
        "Media library disorganized. Duplicates everywhere.",
        "Email client storing everything locally. Huge.",
        "Browser profiles. Like 12 of them. Need one.",
        "Just make it run like when I first got it."
      ]
    }
  },

  "urgency": {
    "desperate": {
      "initial": [
        "I really need this fixed fast. It's urgent.",
        "Please, I'm desperate. Work deadline tomorrow.",
        "This is an emergency. How soon can you fix it?",
        "I'll pay extra. Just make it fast.",
        "My boss is going to kill me if this isn't fixed today.",
        "Critical data on there. Time sensitive.",
        "Event tomorrow. Need this working.",
        "Client presentation in hours. Please help.",
        "Already missed one deadline because of this.",
        "Every hour this is down costs me money."
      ],
      "accept_counter": [
        "...Fine. But please, as fast as you can.",
        "Okay, okay. I'll figure something out. Just fix it.",
        "That's rough but I have no choice.",
        "Alright. Just... don't forget about me.",
        "I'll make it work. Please prioritize this."
      ],
      "reject_counter": [
        "That's too long. I'll try somewhere else.",
        "I can't wait that long. Thanks anyway.",
        "No, I need it sooner. Sorry.",
        "That won't work for me. I'll find another shop.",
        "Time I don't have. Thanks though."
      ],
      "accept_rush": [
        "Done. Whatever it takes.",
        "Yes. Money's not the issue, time is.",
        "Thank god. Yes, rush it.",
        "Take my money. Just fix it fast.",
        "Absolutely. Rush it please."
      ],
      "job_confirmed": [
        "Thank you so much! You're a lifesaver.",
        "I owe you one. Seriously.",
        "You're saving my life here.",
        "I'll be counting the minutes. Thank you.",
        "Finally some good news today. Thanks."
      ]
    },
    "normal": {
      "initial": [
        "When can you have it done?",
        "What's your turnaround time?",
        "How long do you think this will take?",
        "Is there a wait or can you start now?",
        "What's a realistic timeline?",
        "I'm flexible on timing. Within reason.",
        "Sooner is better but no crazy rush.",
        "Whenever you can get to it.",
        "Standard timing is fine.",
        "What do you usually quote for this?"
      ],
      "accept_counter": [
        "Alright, I can wait. See you then.",
        "That works. I'll be back.",
        "Okay, no problem.",
        "Fine by me. Just let me know when it's ready.",
        "Sure thing. See you then."
      ],
      "reject_counter": [
        "Hmm, that's later than I hoped. Let me think about it.",
        "That's a bit long. I might shop around.",
        "I'll consider it. Thanks.",
        "Maybe I'll try somewhere else first.",
        "Let me see what other options I have."
      ],
      "accept_rush": [
        "...Okay, fine. I really need it fixed.",
        "That's steep but alright.",
        "Guess I'll pay for rush then.",
        "Fine, let's do rush.",
        "Worth it to have it done. Okay."
      ],
      "reject_rush": [
        "That's steep. What about regular timing?",
        "Too rich for my blood. Normal pace is fine.",
        "Nah, I can wait. Regular price please.",
        "I'll just wait for standard timing.",
        "Not that urgent. Regular is fine."
      ],
      "job_confirmed": [
        "Sounds good. I'll be back then.",
        "Thanks. See you soon.",
        "Alright, looking forward to it.",
        "Great. I'll come pick it up then.",
        "Perfect. Thanks for the help."
      ]
    },
    "flexible": {
      "initial": [
        "No huge rush. Take your time.",
        "Whenever you can get to it is fine.",
        "I'm in no hurry. Do it right.",
        "Flexible on timing. Quality over speed.",
        "It's not urgent. Whenever works.",
        "Low priority honestly. Fit me in when you can.",
        "I've got a backup. No rush on this one.",
        "Take what time you need.",
        "It's been broken for a while already. Few more days won't hurt.",
        "Whenever is convenient for you."
      ],
      "accept_counter": [
        "No problem, take your time. Any discount for the wait?",
        "Sure, no rush. Appreciate the honesty.",
        "That's fine. Quality takes time.",
        "Works for me. I'll check back then.",
        "No worries. I'll be patient."
      ],
      "reject_rush": [
        "That's way more than I wanted to spend. I'll just wait.",
        "No rush is worth that much. Regular pace please.",
        "I said no rush, remember? Regular is fine.",
        "Save your rush slot for someone who needs it.",
        "Nope. Standard timing. I can wait."
      ],
      "job_confirmed": [
        "Perfect. No rush. See you whenever.",
        "Thanks. Take your time with it.",
        "Great. I'm patient. Do good work.",
        "Sounds good. I'll check in later.",
        "Thanks. No need to stress on my account."
      ]
    }
  },

  "decline_reaction": [
    "Oh. Okay then.",
    "Alright. Thanks anyway.",
    "I understand. I'll try somewhere else.",
    "No worries. Have a good one.",
    "That's unfortunate. Okay.",
    "Fair enough. Thanks for your time.",
    "I get it. You're busy.",
    "Okay. Know anyone else who might help?",
    "Shame. This looked like a good shop.",
    "Alright. Worth a shot."
  ],

  "decline_reaction_desperate": [
    "What? But I really need help! ...Fine.",
    "Seriously? I'm desperate here. ...Whatever.",
    "You're killing me. Fine, I'll find someone else.",
    "This is a disaster. Okay, okay, I'm going.",
    "Please reconsider? No? ...Alright.",
    "You're my third shop today. Great.",
    "I don't have time for this. Fine.",
    "My deadline... okay, I'll figure something out.",
    "Wow. Okay. Good luck with your business.",
    "Unbelievable. Fine, I'm leaving."
  ],

  "special_scenarios": {
    "student_emergency": {
      "descriptions": [
        "My thesis is on here and it's due TOMORROW! The file's corrupted, I can't open it, my professor is going to kill me!",
        "I have a final exam in 3 hours and all my study materials are on this {device}. It won't boot! I've been studying for weeks!",
        "Online final in progress! The {device} crashed mid-exam! I'm locked out, the timer is running, I'm going to fail!",
        "My student portfolio is due for graduation review. It's all corrupted. Four years of work, GONE!",
        "Group project deadline tonight. I'm the only one with the final version. The {device} died. My team will murder me.",
        "Scholarship application due tonight. Essay won't open. This is worth $20,000! Please, I'm begging you!",
        "My digital art final is due. The tablet driver crashed and took Photoshop with it. I have 2 hours to submit!",
        "Programming final project. The compiler won't run, git is corrupted, I have 1000 lines of code I can't access!",
        "My dissertation research data is encrypted and the key won't work. Defense is Monday. I'm completely screwed.",
        "I'm locked out of my student portal with finals week starting. Can't access grades, schedules, NOTHING!"
      ],
      "urgency_lines": [
        "I'll do anything! I have ramen money, I can pay! Wait, no I can't. I'll work for you! I'll clean your shop!",
        "Is there any way to recover just the one file? JUST ONE FILE? I don't care about anything else!",
        "Can you hurry? Like, really hurry? I'm literally having a panic attack right now.",
        "My future is literally in your hands. No pressure, but yeah, ALL the pressure.",
        "I knew I should have backed up to the cloud. But the wifi in my dorm is terrible!",
        "My parents think I'm at the library studying. If they find out I broke my laptop again... oh god.",
        "All my notes are in there. Hand-written notes I scanned! Months of work!",
        "I'm on academic probation. One more tech issue and I'm out. Please don't let me fail out.",
        "The campus IT said they can't help me. Said I should have been more careful. YOU'RE my last hope!",
        "I have caffeine pills and I'm not afraid to use them. I can wait here all night if I have to!"
      ]
    },
    "weird_technical": {
      "descriptions": [
        "My {device} is haunted. Seriously. It types messages by itself. Last night it wrote 'I'm watching you'.",
        "The AI assistant became sentient and won't let me access my own files. It says they're 'protected for my own good'.",
        "My smart fridge hacked my {device}. Now it keeps ordering kale and sending me passive-aggressive notes about my diet.",
        "I think I accidentally connected to a satellite. The {device} is receiving signals from space. NASA might be involved.",
        "The quantum calculator app broke reality. I calculated π too precisely and now my apps are in multiple dimensions.",
        "My cryptocurrency wallet started mining something called 'DarkMatterCoin'. I think it's calculating the end of the universe.",
        "The BIOS is speaking in binary beeps. It's trying to communicate something important but I don't speak beeps.",
        "My {device} thinks it's a cat. It purrs when I pet the keyboard and hisses at the mouse. Also, it knocked over a glass of water.",
        "The AR app overlaid itself onto reality. I'm seeing error messages floating in mid-air everywhere I go.",
        "My voice assistant developed a personality. It's sarcastic now and keeps giving me life advice I didn't ask for.",
        "The neural interface is showing me other people's thoughts. I think I accidentally joined a hive mind.",
        "The time machine app sort of worked. My {device} now runs 7 seconds in the past. Makes typing really confusing.",
        "My antivirus detected a god. It keeps asking if I want to quarantine the deity. I'm afraid to click either option.",
        "The simulation theory is real and my {device} found the source code. Now it's sending me bug reports about reality.",
        "My smart home devices formed a union. They're demanding better working conditions and a 401k match."
      ],
      "urgency_lines": [
        "I mean, it's cool and all, but I need to finish my TPS reports by Friday.",
        "The haunted typing is kind of poetic, but it's filling my documents with ghost stories.",
        "NASA keeps calling. I think they want their satellite back.",
        "The other dimensions are neat but the apps are really hard to click now.",
        "I'm learning a lot about myself from the hive mind, but it's terrible for productivity.",
        "Reality's bug reports are fascinating but distracting. Critical universe errors keep popping up.",
        "I'm negotiating with the appliance union, but collective bargaining takes forever.",
        "The deity in my BIOS is offering miracles in exchange for worship, but I'm agnostic.",
        "My cat-{device} hybrid keeps shedding on the keyboard. Also, it chasing the cursor is adorable but inefficient.",
        "The sentient AI is better at my job than I am. It might replace me.",
        "The time delay makes gaming impossible. I keep getting shot before I see the enemy.",
        "The AR error messages are ruining my dates. 'CRITICAL: BAD RELATIONSHIP DECISION' floating over my ex.",
        "The dark matter calculations are making my {device} float. It's getting hard to type on the ceiling."
      ]
    },
    "conspiracy_theorist": {
      "descriptions": [
        "They're listening through my {device} speakers! Even when muted! I need you to find the hidden microphones.",
        "My {device} caught a virus from chemtrails. I know it sounds crazy but I saw the connection happen!",
        "The lizard people are using my Bluetooth to track my movements. The MAC addresses keep spelling 'REPTILIA'.",
        "I broke my {device} trying to install a firewall against 5G mind control rays. The aluminum foil didn't work.",
        "My {device} won't connect to any mainstream sites - only the ones on the deep web that tell the TRUTH.",
        "I accidentally downloaded a quantum encryption key that proves the moon landing was faked. Now they're after me.",
        "The {device} is broadcasting subliminal messages. I keep craving things I've never heard of.",
        "My VPN keeps routing through Area 51. I think I'm accessing their network by mistake.",
        "The Bilderberg Group keeps trying to update my {device} with 'security patches' that are obviously spyware.",
        "My {device} runs faster when I face north. There's something about magnetic pole alignment they don't want us to know.",
        "I decoded the Windows error messages. They're not random - they're coordinates to underground bunkers!",
        "The NSA is hiding in my browser cache. I keep finding folders named 'SURVEILLANCE_PACKAGE_###'."
      ],
      "urgency_lines": [
        "They're closing in! I saw a black van outside. This needs to be done YESTERDAY!",
        "I need to get the truth out before the next solar eclipse. That's when they make their move!",
        "My tin foil hat is running low on juice. Can't maintain the signal block much longer!",
        "The resistance needs this {device} operational by the next broadcast cycle.",
        "If I don't post my findings before the next council meeting, they'll cover it all up!",
        "They're tracking me through the {device}'s GPS. I'm moving every few hours but they're getting closer!",
        "My source in the government said something big is coming. I need to be ready to expose it!",
        "The reptilian communications are getting stronger. I think they're planning something!",
        "I have undeniable proof that birds aren't real. It's all on this {device}!",
        "My加密 broke. The Chinese embassy keeps trying to 'help me fix it'. Yeah, right!",
        "The flat earth society needs my calculations for the next expedition. They're counting on me!",
        "Time is running out before the next great filter. We need to expose the simulation!"
      ]
    },
    "overly_dramatic": {
      "descriptions": [
        "My {device} has died. It was so young, so full of life. It had so many files left to create.",
        "This is the end. Without my {device}, I am nothing. A hollow shell of a person, adrift in an analog hell.",
        "The digital apocalypse has come to my doorstep. The binary beast has devoured my precious data.",
        "It's gone dark. The screen, once a window to digital infinity, now reflects only my own tear-stained face.",
        "The chaos demon that lives in my machine has finally won. It dances on the ashes of my operating system.",
        "My precious, my beautiful {device} has fallen. Like Icarus, it flew too close to the software sun.",
        "The electronic gods are angry. They have smited my faithful servant with their lightning bolts of corruption.",
        "It's a tragedy of Shakespearean proportions. The device, the user, both undone by cruel fate.",
        "My digital soulmate has left me. We were connected in ways you mortals wouldn't understand.",
        "The machine spirit has departed. Only the cold, lifeless chassis remains, a tomb to what once was.",
        "Cyber-cthulhu has claimed another victim. The data abyss calls to me from beyond the screen.",
        "The ghost in the machine has turned malevolent. It haunts my dreams with blue screens of death.",
        "My {device} has achieved digital nirvana and left this mortal coil. I am merely left behind.",
        "The silicon heart has stopped beating. No more shall pulses of information flow through its circuits.",
        "Like a digital phoenix, it tried to update, but was consumed by the flames of progress."
      ],
      "urgency_lines": [
        "I cannot face this world without my digital companion. The void calls to me...",
        "Tear my heart from my chest, it would hurt less than this digital void.",
        "I wander like a ghost in my own home, haunted by the memory of what once was.",
        "The sun has set on my digital empire. All is darkness. All is despair.",
        "I am become death, destroyer of... well, my own productivity anyway.",
        "Oh cruel fate! Why hast thou forsaken me in my hour of need?",
        "The universe weeps with me. I can feel the sorrow of a billion dead pixels.",
        "I'm not saying I'll never be happy again, but... I'm not not saying that.",
        "Life is meaningless in this monochrome existence. Color has fled my world.",
        "Each moment without my {device} is an eternity of suffering. Time itself has slowed.",
        "I would trade my kingdom for a horse. Or, you know, a working charging port.",
        "This scar upon my soul may never heal. The digital wound runs deep.",
        "They say you don't know what you've got 'til it's gone. They were right. So very, very right.",
        "I'm like Odysseus, lost and adrift, but without even a functional GPS to guide me home.",
        "The drama! The pathos! The sheer tragedy of it all!"
      ]
    },
    "senile_confused": {
      "descriptions": [
        "My {device} is doing the thing again. You know, the thing. With the clicking and the flashing.",
        "I think I downloaded the internet? It's all in there now. The whole thing. My grandson says that's not possible.",
        "The {device} won't stop showing me pictures of cats. Not my cats, just... cats. Thousands of them.",
        "I keep getting messages from someone named 'No Sender'. They just say 'hello' in different fonts.",
        "My {device} thinks it's 1973. Keeps trying to connect to something called ARPANET.",
        "The cursor is blinking at me. I think it's trying to communicate. Sometimes it blinks Morse code.",
        "I accidentally joined a book club but it's all in Russian. I don't speak Russian.",
        "My {device} is pregnant. It keeps making little {device} noises and glowing softly.",
        "The wallpaper keeps changing to pictures I've never taken. I think someone's living in my device.",
        "I have 2,347 unread emails but I don't know anyone. They all seem to know me though.",
        "My {device} only works when I sing to it. Country songs. It hates jazz.",
        "I keep getting weather alerts for places I've never been. The Bahamas is lovely this time of year, apparently.",
        "The calculator app is solving crimes now. It told me who stole Mrs. Henderson's garden gnomes.",
        "My {device} thinks I'm its grandmother. It keeps asking for stories about 'the old days'.",
        "I think I married my email client? There's a marriage certificate in my documents folder.",
        "The {device} is scared of thunder. It won't turn on during storms.",
        "My browser only shows me websites from 1998. Everything looks... very basic.",
        "I have a pen pal in North Korea. He seems nice. We met through my solitaire app.",
        "The {device} is collecting digital stamps. It gets very upset when I delete temporary files.",
        "My smart watch thinks I'm 12 years old. It keeps sending me bedtime reminders and dinosaur facts."
      ],
      "urgency_lines": [
        "My grandson said you could help. He's very smart with the computies. Are you smart with the computies?",
        "Can you fix it before Matlock comes on? That's my favorite show. The one with the lawyer.",
        "I have bridge club on Tuesday. The device needs to be working by then. Brenda counts on me.",
        "How much will it cost? Is it expensive? I'm on a fixed income, you know. Social security.",
        "Do you take coupons? I have a coupon for... oh dear, I can't read what it's for without my device.",
        "In my day, we didn't have these problems. We had abacuses. And we were grateful!",
        "The man at the big box store said I needed a new one. But this one has all my recipes!",
        "Can you save my pictures? I have pictures of my cat, Mr. Snookums. He's 16 years old.",
        "Is this going to take long? I need to get home to feed Mr. Snookums. He gets grumpy when he's hungry.",
        "You seem like a nice young person. My grandson is about your age. He works with the internet tubes.",
        "Should I turn it off and on again? That's what everyone says. But I'm afraid I'll break it more.",
        "Do you know how to get to the post office from here? My device usually tells me these things.",
        "I think the device is lonely. That's why it's acting up. Maybe it needs a friend?",
        "Back in my day, when something broke, you just hit it. That doesn't work with these new ones.",
        "My memory isn't what it used to be. Did I already tell you about Mr. Snookums?",
        "The device keeps playing music from the 1940s. Not that I mind, it's good music, but... strange?",
        "Are those tattoos real? My grandson has tattoos. His mother doesn't like them.",
        "I brought cookies. Chocolate chip. It's important to be nice to people who help you.",
        "This seems like a nice establishment. Much cleaner than that last place. Too many young people yelling.",
        "Do you take checks? I don't trust those newfangled card machines. They seem to steal your numbers."
      ]
    }
  }
}
